app/controllers/tasks_controller.rb

  def index
    @incomplete_tasks = Task.where(complete: false)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."complete" = ?  [["complete", "f"]]

  def create
    @task = Task.create!(set_params)
---
INSERT INTO "tasks" ("name", "complete", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["complete", "t"], ["created_at", "2019-01-07 15:11:32.245921"], ["updated_at", "2019-01-07 15:11:32.245921"]]

  def update
    @task = Task.find(params[:id])
    @task.update_attributes!(set_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2019-01-05 13:49:39.126056"], ["id", 3]]

  def destroy
    @task = Task.destroy(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]